Revit 2024 API
IFCTransaction Constructor
 Instantiates a transaction object.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public IFCTransaction(
	IFCFile file
)
Visual Basic
Public Sub New ( _
	file As IFCFile _
)
Visual C++
public:
IFCTransaction(
	IFCFile^ file
)
Parameters
file
Type: Autodesk.Revit.DB.IFC.IFCFile
 The IFC file for which this transaction is going to be used.
Remarks
 The transaction starts by creating a transaction object.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
IFCTransaction Class
Autodesk.Revit.DB.IFC Namespace